app/Controllers/Admin/Categories.php

SELECT *
FROM `service_categories`
---
    public function index() {
        $model = new ServiceCategoryModel();
        return view('admin/categories/index', [
            'categories' => $model->findAll()
        ]);

INSERT INTO `service_categories` (`name`, `slug`, `type`) VALUES ('Social Media ', 'social-media', 'bundle')
---
    public function create() {

        if ($this->request->getMethod() === 'POST') {
            $form = $this->request->getPost();
            if (empty($form['slug']) && !empty($form['name'])) {
                $form['slug'] = strtolower(trim(preg_replace('/[^A-Za-z0-9-]+/', '-', $form['name'])));
            }
            $model = new ServiceCategoryModel();
            $model->insert($this->request->getPost());