app/Controllers/Admin/Services.php

      public function index()
    {
        $model = new ServiceModel();
        $categoryModel = new ServiceCategoryModel();

        $services = $model->findAll();
---
SELECT *
FROM `services`

    public function create()
    {
        $categoryModel = new ServiceCategoryModel();

        if ($this->request->getMethod() === 'POST') {
            $model = new ServiceModel();
            $form = $this->request->getPost();
            $form['features'] = $form['features'] ?? '';
            $form['is_active'] = $form['is_active'] ?? 0;
            $model->insert($form);
            return redirect()->to('/admin/services');
        }

        return view('admin/services/create', [
            'categories' => $categoryModel->findAll()
        ]);
---
SELECT *
FROM `service_categories`