app/Controllers/Home.php

SELECT *
FROM `service_categories`
WHERE `type` = 'individual'
SELECT *
FROM `service_categories`
WHERE `type` = 'bundle'
SELECT *
FROM `services`
WHERE `category_id` = '1'
SELECT *
FROM `services`
WHERE `category_id` = '2'
---
    public function ftagig() {
        // $gigModel = new \App\Models\GigServiceModel();
        // $data['gigs'] = $gigModel->findAll();

        //return view('ftagig');
        $categoryModel = new ServiceCategoryModel();
        $serviceModel  = new ServiceModel();

        $individual_categories = $categoryModel->where('type', 'individual')->findAll();
        $bundle_categories     = $categoryModel->where('type', 'bundle')->findAll();

        $individual_services = [];
        foreach ($individual_categories as $cat) {
            $individual_services[$cat['id']] = $serviceModel
                ->where('category_id', $cat['id'])
                ->findAll();
        }

        $bundle_services = [];
        foreach ($bundle_categories as $cat) {
            $bundle_services[$cat['id']] = $serviceModel
                ->where('category_id', $cat['id'])
                ->findAll();